{"_name_or_path": "ai4bharat/indicNER", "architectures": ["BertForTokenClassification"], "attention_probs_dropout_prob": 0.1, "classifier_dropout": null, "directionality": "bidi", "finetuning_task": "ner", "gradient_checkpointing": false, "hidden_act": "gelu", "hidden_dropout_prob": 0.1, "hidden_size": 768, "id2label": {"0": "O", "1": "B-PER", "2": "I-PER", "3": "B-ORG", "4": "I-ORG", "5": "B-LOC", "6": "I-LOC"}, "initializer_range": 0.02, "intermediate_size": 3072, "label2id": {"O": "0", "B-PER": "1", "I-PER": "2", "B-ORG": "3", "I-ORG": "4", "B-LOC": "5", "I-LOC": "6"}, "layer_norm_eps": 1e-12, "max_position_embeddings": 512, "model_type": "bert", "num_attention_heads": 12, "num_hidden_layers": 12, "pad_token_id": 0, "pooler_fc_size": 768, "pooler_num_attention_heads": 12, "pooler_num_fc_layers": 3, "pooler_size_per_head": 128, "pooler_type": "first_token_transform", "position_embedding_type": "absolute", "torch_dtype": "float32", "transformers_version": "4.38.1", "type_vocab_size": 2, "use_cache": true, "vocab_size": 105879}